Autodesk.Revit.DB.ParameterFilterElement.GetRules
Returns the rules of this filter, in the order in which they are applied.
Since:
2011

Autodesk.Revit.DB.ParameterFilterElement.SetCategories(System.Collections.Generic.ICollection{Autodesk.Revit.DB.ElementId})
Sets the categories admitted by this filter.
Remarks:
Testing that an element's category is a member of this set is,
essentially, the first rule of the filter.
Changing the set of categories will clear the element's filter rules.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2011